bastianraschke/ardukey-firmware/Sketchbook/hardware/tinyUSBboard/boards.txt
##########tinyUSBboard (Rev.2 and previous)###(magic=0xfe65a980)#####################
oldtinyUSBboard.name=tinyUSBboard (USBaspLoader ATmega8 at 16MHz, Rev.2 and previous)
oldtinyUSBboard.upload.tool=avrdude
oldtinyUSBboard.upload.protocol=usbasp
oldtinyUSBboard.upload.maximum_size=6144
oldtinyUSBboard.upload.speed=115200
oldtinyUSBboard.upload.disable_flushing=true
oldtinyUSBboard.bootloader.tool=avrdudenoefuse
oldtinyUSBboard.bootloader.protocol=usbasp
oldtinyUSBboard.bootloader.speed=115200
oldtinyUSBboard.bootloader.low_fuses=0x3F
oldtinyUSBboard.bootloader.high_fuses=0xC0
oldtinyUSBboard.bootloader.path=enus_v0_97_1
oldtinyUSBboard.bootloader.file=rev2_default_enus_lfx3f_hfxc0_v0x97x1.hex
oldtinyUSBboard.bootloader.unlock_bits=0x3F
oldtinyUSBboard.bootloader.lock_bits=0x3F
oldtinyUSBboard.build.mcu=atmega8
oldtinyUSBboard.build.f_cpu=16000000L
oldtinyUSBboard.build.core=arduino:arduino
oldtinyUSBboard.build.variant=oldtinyusbboard



##########tinyUSBboard (Rev.3 and future)###(ATmega88 support, magic=0xfe9a5682)#####
nettinyUSBboard.name=tinyUSBboard (USBaspLoader ATmega88 at 16MHz)
nettinyUSBboard.upload.tool=avrdude
nettinyUSBboard.upload.protocol=usbasp
nettinyUSBboard.upload.maximum_size=6144
nettinyUSBboard.upload.speed=115200
nettinyUSBboard.upload.disable_flushing=true
nettinyUSBboard.bootloader.tool=avrdude
nettinyUSBboard.bootloader.protocol=usbasp
nettinyUSBboard.bootloader.speed=115200
nettinyUSBboard.bootloader.low_fuses=0xF7
nettinyUSBboard.bootloader.high_fuses=0xD4
nettinyUSBboard.bootloader.extended_fuses=0xF8
nettinyUSBboard.bootloader.path=enus_v0_97_1
nettinyUSBboard.bootloader.file=default88_enus_lfxf7_hfxd4_efxf8_v0x97x1.hex
nettinyUSBboard.bootloader.unlock_bits=0x3F
nettinyUSBboard.bootloader.lock_bits=0x3F
nettinyUSBboard.build.mcu=atmega168
nettinyUSBboard.build.f_cpu=16000000L
nettinyUSBboard.build.core=arduino:arduino
nettinyUSBboard.build.variant=tinyusbboard


##########tinyUSBboard (Rev.3 and future)###(ATmega168(p) support, magic=0xfe9a5683)#
neutinyUSBboard.name=tinyUSBboard (USBaspLoader ATmega168/168p at 16MHz)
neutinyUSBboard.upload.tool=avrdude
neutinyUSBboard.upload.protocol=usbasp
neutinyUSBboard.upload.maximum_size=14336
neutinyUSBboard.upload.speed=115200
neutinyUSBboard.upload.disable_flushing=true
neutinyUSBboard.bootloader.tool=avrdude
neutinyUSBboard.bootloader.protocol=usbasp
neutinyUSBboard.bootloader.speed=115200
neutinyUSBboard.bootloader.low_fuses=0xF7
neutinyUSBboard.bootloader.high_fuses=0xD4
neutinyUSBboard.bootloader.extended_fuses=0xF8
neutinyUSBboard.bootloader.path=enus_v0_97_1
neutinyUSBboard.bootloader.file=default168_enus_lfxf7_hfxd4_efxf8_v0x97x1.hex
neutinyUSBboard.bootloader.unlock_bits=0x3F
neutinyUSBboard.bootloader.lock_bits=0x3F
neutinyUSBboard.build.mcu=atmega168
neutinyUSBboard.build.f_cpu=16000000L
neutinyUSBboard.build.core=arduino:arduino
neutinyUSBboard.build.variant=tinyusbboard



##########tinyUSBboard (Rev.3 and future)###(ATmega368 support, magic=0xfe6a5984)####
nevtinyUSBboard.name=tinyUSBboard (USBaspLoader ATmega328 (without p) at 16MHz)
nevtinyUSBboard.upload.tool=avrdude
nevtinyUSBboard.upload.protocol=usbasp
nevtinyUSBboard.upload.maximum_size=28672
nevtinyUSBboard.upload.speed=115200
nevtinyUSBboard.upload.disable_flushing=true
nevtinyUSBboard.bootloader.tool=avrdude
nevtinyUSBboard.bootloader.protocol=usbasp
nevtinyUSBboard.bootloader.speed=115200
nevtinyUSBboard.bootloader.low_fuses=0xF7
nevtinyUSBboard.bootloader.high_fuses=0xD0
nevtinyUSBboard.bootloader.extended_fuses=0x04
nevtinyUSBboard.bootloader.path=enus_v0_97_1
nevtinyUSBboard.bootloader.file=default328_enus_lfxf7_hfxd0_efx04_v0x97x1.hex
nevtinyUSBboard.bootloader.unlock_bits=0x3F
nevtinyUSBboard.bootloader.lock_bits=0x3F
nevtinyUSBboard.build.mcu=atmega328
nevtinyUSBboard.build.f_cpu=16000000L
nevtinyUSBboard.build.core=arduino:arduino
nevtinyUSBboard.build.variant=tinyusbboard



##########tinyUSBboard (Rev.3 and future)###(magic=0xfe9a5680)#######################
newtinyUSBboard.name=tinyUSBboard (USBaspLoader ATmega328p at 16MHz)
newtinyUSBboard.upload.tool=avrdude
newtinyUSBboard.upload.protocol=usbasp
newtinyUSBboard.upload.maximum_size=28672
newtinyUSBboard.upload.speed=115200
newtinyUSBboard.upload.disable_flushing=true
newtinyUSBboard.bootloader.tool=avrdude
newtinyUSBboard.bootloader.protocol=usbasp
newtinyUSBboard.bootloader.speed=115200
newtinyUSBboard.bootloader.low_fuses=0xF7
newtinyUSBboard.bootloader.high_fuses=0xD0
newtinyUSBboard.bootloader.extended_fuses=0x04
newtinyUSBboard.bootloader.path=enus_v0_97_1
newtinyUSBboard.bootloader.file=default328p_enus_lfxf7_hfxd0_efx04_v0x97x1.hex
newtinyUSBboard.bootloader.unlock_bits=0x3F
newtinyUSBboard.bootloader.lock_bits=0x3F
newtinyUSBboard.build.mcu=atmega328p
newtinyUSBboard.build.f_cpu=16000000L
newtinyUSBboard.build.core=arduino:arduino
newtinyUSBboard.build.variant=tinyusbboard

tinyUSBboard.name=tinyUSBboard (USBaspLoader ATmega8 at 16MHz)
tinyUSBboard.upload.tool=avrdude
tinyUSBboard.upload.protocol=usbasp
tinyUSBboard.upload.maximum_size=6144
tinyUSBboard.upload.speed=115200
tinyUSBboard.upload.disable_flushing=true
tinyUSBboard.bootloader.tool=avrdudenoefuse
tinyUSBboard.bootloader.protocol=usbasp
tinyUSBboard.bootloader.speed=115200
tinyUSBboard.bootloader.low_fuses=0x3F
tinyUSBboard.bootloader.high_fuses=0xC0
tinyUSBboard.bootloader.path=enus_v0_97_1
tinyUSBboard.bootloader.file=default_enus_lfx3f_hfxc0_v0x97x1.hex
tinyUSBboard.bootloader.unlock_bits=0x3F
tinyUSBboard.bootloader.lock_bits=0x3F
tinyUSBboard.build.mcu=atmega8
tinyUSBboard.build.f_cpu=16000000L
tinyUSBboard.build.core=arduino:arduino
tinyUSBboard.build.variant=tinyusbboard
